RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_dac.c
/*!
    \file    gd32h75e_dac.c
    \brief   DAC driver

    \version 2025-08-07, V1.2.0, firmware for GD32H75E
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32h75e_dac.h"

/* DAC register bit offset */
#define OUT1_REG_OFFSET           ((uint32_t)0x00000010U)
#define DH_12BIT_OFFSET           ((uint32_t)0x00000010U)
#define DH_8BIT_OFFSET            ((uint32_t)0x00000008U)

#define DAC_STAT_FLAG_MASK0       (DAC_FLAG_DDUDR0 | DAC_FLAG_DDUDR1 | DAC_FLAG_CALF0 | DAC_FLAG_CALF1 | DAC_FLAG_BWT0 | DAC_FLAG_BWT1)
#define DAC_INT_EN_MASK0          (DAC_INT_DDUDR0 | DAC_INT_DDUDR1)
#define DAC_INT_FLAG_MASK0        (DAC_INT_FLAG_DDUDR0 | DAC_INT_FLAG_DDUDR1)

/*!
    \brief      deinitialize DAC
    \param[in]  dac_periph: DACx(x=0)
    \param[out] none
    \retval     none
*/
void dac_deinit(uint32_t dac_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0001U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(dac_periph){
            case DAC0:
                /* reset DAC0 */
                rcu_periph_reset_enable(RCU_DACRST);
                rcu_periph_reset_disable(RCU_DACRST);
                break;
            default:
                break;
        }
    }
}

/*!
    \brief      enable DAC
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[out] none
    \retval     none
*/
void dac_enable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0002U), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) |= (uint32_t)DAC_CTL0_DEN0;
        }else if(DAC_OUT1 == dac_out){
            DAC_CTL0(dac_periph) |= (uint32_t)DAC_CTL0_DEN1;
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      disable DAC
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[out] none
    \retval     none
*/
void dac_disable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0003U), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DEN0);
        }else if(DAC_OUT1 == dac_out){
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DEN1);
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable DAC DMA function
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[out] none
    \retval     none
*/
void dac_dma_enable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0004U), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) |= (uint32_t)DAC_CTL0_DDMAEN0;
        }else if(DAC_OUT1 == dac_out){
            DAC_CTL0(dac_periph) |= (uint32_t)DAC_CTL0_DDMAEN1;
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      disable DAC DMA function
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[out] none
    \retval     none
*/
void dac_dma_disable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0005U), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DDMAEN0);
        }else if(DAC_OUT1 == dac_out){
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DDMAEN1);
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure DAC mode
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[in]  mode: DAC working mode
                only one parameter can be selected which is shown as below:
      \arg        NORMAL_PIN_BUFFON: DAC_OUT_x work in normal mode and connect to external pin with buffer enable
      \arg        NORMAL_PIN_PERIPHERAL_BUFFON: DAC_OUT_x work in normal mode and connect to external pin and on chip peripherals with buffer enable
      \arg        NORMAL_PIN_BUFFOFF: DAC_OUT_x work in normal mode and connect to external pin with buffer disable
      \arg        NORMAL_PIN_PERIPHERAL_BUFFOFF: DAC_OUT_x work in normal mode and connect to on chip peripherals with buffer disable
      \arg        SAMPLEKEEP_PIN_BUFFON: DAC_OUT_x work in sample and keep mode and connect to external pin with buffer enable
      \arg        SAMPLEKEEP_PIN_PERIPHERAL_BUFFON: DAC_OUT_x work in sample and keep mode and connect to external pin and on chip peripherals with buffer enable
      \arg        SAMPLEKEEP_PIN_BUFFOFF: DAC_OUT_x work in sample and keep mode and connect to external pin and on chip peripherals with buffer enable
      \arg        SAMPLEKEEP_PIN_PERIPHERAL_BUFFOFF: DAC_OUT_x work in sample and keep mode and connect to on chip peripherals with buffer disable
    \param[out] none
    \retval     none
*/
void dac_mode_config(uint32_t dac_periph, uint32_t dac_out, uint32_t mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0006U), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0006U), ERR_PARAM_INVALID);
    } else if(NOT_DAC_MODE(mode)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0006U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* configure DAC0 mode */
            DAC_MDCR(dac_periph) &= ~(uint32_t)DAC_MDCR_MODE0;
            DAC_MDCR(dac_periph) |= mode;
        }else if(DAC_OUT1 == dac_out){
            /* configure DAC1 mode */
            DAC_MDCR(dac_periph) &= ~(uint32_t)DAC_MDCR_MODE1;
            DAC_MDCR(dac_periph) |= (mode << OUT1_REG_OFFSET);
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      get the DACx trimming value
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[out] none
    \retval     DACx trimming value
*/
uint32_t dac_trimming_value_get(uint32_t dac_periph, uint32_t dac_out)
{
    uint32_t tmp = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0007U), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out) {
            /* get the DAC_OUT_0 trimming value */
            tmp = DAC_CALR(dac_periph) & DAC_CALR_OTV0;
        } else if(DAC_OUT1 == dac_out) {
            /* get the DAC_OUT_1 trimming value */
            tmp = (DAC_CALR(dac_periph) & DAC_CALR_OTV1) >> OUT1_REG_OFFSET;
        } else {
        }
    }
    return tmp;
}

/*!
    \brief      set the DACx trimming value
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[in]  trim_value: set new DAC trimming value
    \param[out] none
*/
void dac_trimming_value_set(uint32_t dac_periph, uint32_t dac_out, uint32_t trim_value)
{
    uint32_t tmp = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0008U), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0008U), ERR_PARAM_INVALID);
    } else if(NOT_DAC_TRIM_VALUE(trim_value)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0008U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
    /* get the trimming value */
        tmp = DAC_CALR(dac_periph);

