RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_dac.c
        if(DAC_OUT0 == dac_out) {
            /* set the DACx_OUT0 trimming value */
            tmp &= ~(uint32_t)DAC_CALR_OTV0;
            tmp |= (trim_value & DAC_CALR_OTV0);
            DAC_CALR(dac_periph) = tmp;
        }else if(DAC_OUT1 == dac_out){
            /* set the DACx_OUT1 trimming value */
            tmp &= ~(uint32_t)DAC_CALR_OTV1;
            tmp |= ((trim_value << OUT1_REG_OFFSET) & DAC_CALR_OTV1);
            DAC_CALR(dac_periph) = tmp;
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable the DACx trimming
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[out] none
*/
void dac_trimming_enable(uint32_t dac_periph, uint32_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0009U), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* enable the DACx_OUT0 trimming */
            DAC_CTL0(dac_periph) |= DAC_CTL0_CALEN0;
        }else if(DAC_OUT1 == dac_out){
            /* enable the DACx_OUT1 trimming */
            DAC_CTL0(dac_periph) |= DAC_CTL0_CALEN1;
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      get DAC output value
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[out] none
    \retval     DAC output data: 0~4095
*/
uint16_t dac_output_value_get(uint32_t dac_periph, uint8_t dac_out)
{
    uint16_t data = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000AU), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* store the DACx_OUT0 output value */
            data = (uint16_t)DAC_OUT0_DO(dac_periph);
        }else if(DAC_OUT1 == dac_out){
            /* store the DACx_OUT1 output value */
            data = (uint16_t)DAC_OUT1_DO(dac_periph);
        }else{
            /* illegal parameters */
        }
    }

    return data;
}

/*!
    \brief      set DAC data holding register value
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[in]  dac_align: DAC data alignment mode
                only one parameter can be selected which is shown as below:
      \arg        DAC_ALIGN_12B_R: 12-bit right-aligned data
      \arg        DAC_ALIGN_12B_L: 12-bit left-aligned data
      \arg        DAC_ALIGN_8B_R: 8-bit right-aligned data
    \param[in]  data: data to be loaded(0~4095)
    \param[out] none
    \retval     none
*/
void dac_data_set(uint32_t dac_periph, uint8_t dac_out, uint32_t dac_align, uint16_t data)
{
    /* DAC_OUT0 data alignment */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_DAC_ALIGN(dac_align)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            switch(dac_align){
            /* 12-bit right-aligned data */
            case DAC_ALIGN_12B_R:
                DAC_OUT0_R12DH(dac_periph) = data;
                break;
            /* 12-bit left-aligned data */
            case DAC_ALIGN_12B_L:
                DAC_OUT0_L12DH(dac_periph) = data;
                break;
            /* 8-bit right-aligned data */
            case DAC_ALIGN_8B_R:
                DAC_OUT0_R8DH(dac_periph) = data;
                break;
            default:
                break;
            }
        }else if(DAC_OUT1 == dac_out){
            /* DAC_OUT1 data alignment */
            switch(dac_align){
            /* 12-bit right-aligned data */
            case DAC_ALIGN_12B_R:
                DAC_OUT1_R12DH(dac_periph) = data;
                break;
            /* 12-bit left-aligned data */
            case DAC_ALIGN_12B_L:
                DAC_OUT1_L12DH(dac_periph) = data;
                break;
            /* 8-bit right-aligned data */
            case DAC_ALIGN_8B_R:
                DAC_OUT1_R8DH(dac_periph) = data;
                break;
            default:
                break;
            }
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable DAC trigger
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[out] none
    \retval     none
*/
void dac_trigger_enable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) |= (uint32_t)DAC_CTL0_DTEN0;
        }else if(DAC_OUT1 == dac_out){
            DAC_CTL0(dac_periph) |= (uint32_t)DAC_CTL0_DTEN1;
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      disable DAC trigger
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[out] none
    \retval     none
*/
void dac_trigger_disable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000DU), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DTEN0);
        }else if(DAC_OUT1 == dac_out){
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DTEN1);
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure DAC trigger source
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[in]  triggersource: external trigger of DAC
                only one parameter can be selected which is shown as below:
      \arg        DAC_TRIGGER_EXTERNAL: external trigger selected by TRIGSEL
      \arg        DAC_TRIGGER_SOFTWARE: software trigger
    \param[out] none
    \retval     none
*/
void dac_trigger_source_config(uint32_t dac_periph, uint8_t dac_out, uint32_t triggersource)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000EU), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000EU), ERR_PARAM_INVALID);
    } else if(NOT_DAC_TRIGGER(triggersource)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* configure DACx_OUT0 trigger source */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DTSEL0);
            DAC_CTL0(dac_periph) |= triggersource;
        }else if(DAC_OUT1 == dac_out){
            /* configure DACx_OUT1 trigger source */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DTSEL1);
            DAC_CTL0(dac_periph) |= (triggersource << OUT1_REG_OFFSET);
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable DAC software trigger
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \retval     none
*/
void dac_software_trigger_enable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000FU), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_SWT(dac_periph) |= (uint32_t)DAC_SWT_SWTR0;
        }else if(DAC_OUT1 == dac_out){
            DAC_SWT(dac_periph) |= (uint32_t)DAC_SWT_SWTR1;
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure DAC wave mode
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[in]  wave_mode: DAC wave mode
                only one parameter can be selected which is shown as below:
      \arg        DAC_WAVE_DISABLE: wave mode disable
      \arg        DAC_WAVE_MODE_LFSR: LFSR noise mode
      \arg        DAC_WAVE_MODE_TRIANGLE: triangle noise mode
    \param[out] none
    \retval     none
*/
void dac_wave_mode_config(uint32_t dac_periph, uint8_t dac_out, uint32_t wave_mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0010U), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0010U), ERR_PARAM_INVALID);
    } else if(NOT_DAC_WAVE_MODE(wave_mode)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0010U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* configure DACx_OUT0 wave mode */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DWM0);
            DAC_CTL0(dac_periph) |= wave_mode;
        }else if(DAC_OUT1 == dac_out){
            /* configure DACx_OUT1 wave mode */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DWM1);
            DAC_CTL0(dac_periph) |= (wave_mode << OUT1_REG_OFFSET);
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure DAC LFSR noise mode
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[in]  unmask_bits: LFSR noise unmask bits
                only one parameter can be selected which is shown as below:
      \arg        DAC_LFSR_BIT0: unmask the LFSR bit0
      \arg        DAC_LFSR_BITS1_0: unmask the LFSR bits[1:0]
      \arg        DAC_LFSR_BITS2_0: unmask the LFSR bits[2:0]
      \arg        DAC_LFSR_BITS3_0: unmask the LFSR bits[3:0]
      \arg        DAC_LFSR_BITS4_0: unmask the LFSR bits[4:0]
      \arg        DAC_LFSR_BITS5_0: unmask the LFSR bits[5:0]
      \arg        DAC_LFSR_BITS6_0: unmask the LFSR bits[6:0]
      \arg        DAC_LFSR_BITS7_0: unmask the LFSR bits[7:0]
      \arg        DAC_LFSR_BITS8_0: unmask the LFSR bits[8:0]
      \arg        DAC_LFSR_BITS9_0: unmask the LFSR bits[9:0]
      \arg        DAC_LFSR_BITS10_0: unmask the LFSR bits[10:0]
      \arg        DAC_LFSR_BITS11_0: unmask the LFSR bits[11:0]
    \param[out] none
    \retval     none
*/
void dac_lfsr_noise_config(uint32_t dac_periph, uint8_t dac_out, uint32_t unmask_bits)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0011U), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0011U), ERR_PARAM_INVALID);
    } else if(NOT_DAC_UNMASK_BITS(unmask_bits)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0011U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* configure DACx_OUT0 LFSR noise mode */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DWBW0);
            DAC_CTL0(dac_periph) |= unmask_bits;
        }else if(DAC_OUT1 == dac_out){
            /* configure DACx_OUT1 LFSR noise mode */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DWBW1);
            DAC_CTL0(dac_periph) |= (unmask_bits << OUT1_REG_OFFSET);
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure DAC triangle noise mode
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[in]  amplitude: the amplitude of the triangle
                only one parameter can be selected which is shown as below:
      \arg        DAC_TRIANGLE_AMPLITUDE_1: triangle amplitude is 1
      \arg        DAC_TRIANGLE_AMPLITUDE_3: triangle amplitude is 3
      \arg        DAC_TRIANGLE_AMPLITUDE_7: triangle amplitude is 7
      \arg        DAC_TRIANGLE_AMPLITUDE_15: triangle amplitude is 15
      \arg        DAC_TRIANGLE_AMPLITUDE_31: triangle amplitude is 31
      \arg        DAC_TRIANGLE_AMPLITUDE_63: triangle amplitude is 63
      \arg        DAC_TRIANGLE_AMPLITUDE_127: triangle amplitude is 127
      \arg        DAC_TRIANGLE_AMPLITUDE_255: triangle amplitude is 255
      \arg        DAC_TRIANGLE_AMPLITUDE_511: triangle amplitude is 511
      \arg        DAC_TRIANGLE_AMPLITUDE_1023: triangle amplitude is 1023
      \arg        DAC_TRIANGLE_AMPLITUDE_2047: triangle amplitude is 2047
      \arg        DAC_TRIANGLE_AMPLITUDE_4095: triangle amplitude is 4095
    \param[out] none
    \retval     none
*/
void dac_triangle_noise_config(uint32_t dac_periph, uint8_t dac_out, uint32_t amplitude)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else if(NOT_DAC_TRIANGLE_AMPLITUDE(amplitude)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* configure DACx_OUT0 triangle noise mode */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DWBW0);
            DAC_CTL0(dac_periph) |= amplitude;
        }else if(DAC_OUT1 == dac_out){
            /* configure DACx_OUT1 triangle noise mode */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DWBW1);
            DAC_CTL0(dac_periph) |= (amplitude << OUT1_REG_OFFSET);
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable DAC concurrent mode
    \param[in]  dac_periph: DACx(x=0)
    \param[out] none
    \retval     none
*/
void dac_concurrent_enable(uint32_t dac_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t ctl = 0U;

        ctl = (uint32_t)(DAC_CTL0_DEN0 | DAC_CTL0_DEN1);
        DAC_CTL0(dac_periph) |= (uint32_t)ctl;
    }
}

/*!
    \brief      disable DAC concurrent mode
    \param[in]  dac_periph: DACx(x=0)
    \param[out] none
    \retval     none
*/
void dac_concurrent_disable(uint32_t dac_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t ctl = 0U;

        ctl = (uint32_t)(DAC_CTL0_DEN0 | DAC_CTL0_DEN1);
        DAC_CTL0(dac_periph) &= (uint32_t)(~ctl);
    }
}

/*!
    \brief      enable DAC concurrent software trigger
    \param[in]  dac_periph: DACx(x=0)
    \param[out] none
    \retval     none
*/
void dac_concurrent_software_trigger_enable(uint32_t dac_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t swt = 0U;

        swt = (uint32_t)(DAC_SWT_SWTR0 | DAC_SWT_SWTR1);
        DAC_SWT(dac_periph) |= (uint32_t)swt; 
    }
}

/*!
    \brief      set DAC concurrent mode data holding register value
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_align: DAC data alignment mode
                only one parameter can be selected which is shown as below:
      \arg        DAC_ALIGN_12B_R: 12-bit right-aligned data
      \arg        DAC_ALIGN_12B_L: 12-bit left-aligned data
      \arg        DAC_ALIGN_8B_R: 8-bit right-aligned data
    \param[in]  data0: data to be loaded(0~4095)
    \param[in]  data1: data to be loaded(0~4095)
    \param[out] none
    \retval     none
*/
void dac_concurrent_data_set(uint32_t dac_periph, uint32_t dac_align, uint16_t data0, uint16_t data1)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    } else if(NOT_DAC_ALIGN(dac_align)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0016U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t data = 0U;

        switch(dac_align){
        /* 12-bit right-aligned data */
        case DAC_ALIGN_12B_R:
            data = (uint32_t)(((uint32_t)data1 << DH_12BIT_OFFSET) | data0);
            DACC_R12DH(dac_periph) = (uint32_t)data;
            break;
        /* 12-bit left-aligned data */
        case DAC_ALIGN_12B_L:
            data = (uint32_t)(((uint32_t)data1 << DH_12BIT_OFFSET) | data0);
            DACC_L12DH(dac_periph) = (uint32_t)data;
            break;
        /* 8-bit right-aligned data */
        case DAC_ALIGN_8B_R:
            data = (uint32_t)(((uint32_t)data1 << DH_8BIT_OFFSET) | data0);
            DACC_R8DH(dac_periph) = (uint32_t)data;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      set DAC sample and keep time value
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  dac_out: DAC_OUTx(x=0,1)
    \param[in]  sample_time: DAC sample time
    \param[in]  keep_time: DAC keep time
    \param[in]  refresh_time: DAC refresh time
    \param[out] none
    \retval     none
*/
void dac_sample_keep_mode_config(uint32_t dac_periph, uint32_t dac_out, uint32_t sample_time, uint32_t keep_time, uint32_t refresh_time)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    } else if(NOT_DAC_OUT(dac_out)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0017U), ERR_PARAM_INVALID);
    } else if(NOT_DAC_SAMPLE_TIME_VALUE(sample_time)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0017U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_DAC_KEEP_TIME_VALUE(keep_time)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0017U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_DAC_REFRESH_TIME_VALUE(refresh_time)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0017U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t tmp = 0U;

