RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_dac.c
        if(DAC_OUT0 == dac_out){
            /* configure DACx_OUT0 Sample & Keep mode */
            DAC_SKSTR0(dac_periph) |= (sample_time & DAC_SKSTR0_TSAMP0);

            tmp = (DAC_SKKTR(dac_periph) & ~(uint32_t)DAC_SKKTR_TKEEP0);
            DAC_SKKTR(dac_periph) = tmp | (keep_time & DAC_SKKTR_TKEEP0);

            tmp = (DAC_SKRTR(dac_periph) & ~(uint32_t)DAC_SKRTR_TREF0);
            DAC_SKRTR(dac_periph) = tmp | (refresh_time & DAC_SKRTR_TREF0);
        }else if(DAC_OUT1 == dac_out){
            /* configure DACx_OUT1 Sample & Keep mode */
            DAC_SKSTR1(dac_periph) |= (sample_time & DAC_SKSTR1_TSAMP1);

            tmp = (DAC_SKKTR(dac_periph) & ~(uint32_t)DAC_SKKTR_TKEEP1);
            DAC_SKKTR(dac_periph) = tmp | ((keep_time << 16) & DAC_SKKTR_TKEEP1);

            tmp = (DAC_SKRTR(dac_periph) & ~(uint32_t)DAC_SKRTR_TREF1);
            DAC_SKRTR(dac_periph) = tmp | ((refresh_time << 16) & DAC_SKRTR_TREF1);
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      get DAC flag
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  flag: the DAC status flags, only one parameter can be selected which is shown
                as below:
      \arg        DAC_FLAG_DDUDR0: DACx_OUT0 DMA underrun flag
      \arg        DAC_FLAG_CALF0: DACx_OUT0 calibration offset flag
      \arg        DAC_FLAG_BWT0: DACx_OUT0 sample and keep wtire enable flag
      \arg        DAC_FLAG_DDUDR1: DACx_OUT1 DMA underrun flag
      \arg        DAC_FLAG_CALF1: DACx_OUT1 calibration offset flag
      \arg        DAC_FLAG_BWT1: DACx_OUT1 sample and keep wtire enable flag
    \param[out] none
    \retval     the state of DAC bit(SET or RESET)
*/
FlagStatus dac_flag_get(uint32_t dac_periph, uint32_t flag)
{
    FlagStatus flag_state;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    } else if(NOT_DAC_FLAG(flag)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0018U), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(flag & DAC_STAT_FLAG_MASK0){
            /* check DAC_STAT0 flag */
            if(RESET != (DAC_STAT0(dac_periph) & flag)){
                flag_state = SET;
            }else{
                flag_state = RESET;
            }
        }else{
            /* illegal parameters */
            flag_state = RESET;
        }
    }
    return flag_state;
}

/*!
    \brief      clear DAC flag
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  flag: DAC flag
                only one parameter can be selected which is shown as below:
      \arg        DAC_FLAG_DDUDR0: DACx_OUT0 DMA underrun flag
      \arg        DAC_FLAG_CALF0: DACx_OUT0 calibration offset flag
      \arg        DAC_FLAG_BWT0: DACx_OUT0 sample and keep wtire enable flag
      \arg        DAC_FLAG_DDUDR1: DACx_OUT1 DMA underrun flag
      \arg        DAC_FLAG_CALF1: DACx_OUT1 calibration offset flag
      \arg        DAC_FLAG_BWT1: DACx_OUT1 sample and keep wtire enable flag
    \param[out] none
    \retval     none
*/
void dac_flag_clear(uint32_t dac_periph, uint32_t flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    } else if(NOT_DAC_FLAG(flag)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0019U), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(flag & DAC_STAT_FLAG_MASK0){
            /* check DAC_STAT0 flag */
            DAC_STAT0(dac_periph) = (uint32_t)(flag & DAC_STAT_FLAG_MASK0);
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable DAC interrupt
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  interrupt: the DAC interrupt
                only one parameter can be selected which is shown as below:
      \arg        DAC_INT_DDUDR0: DACx_OUT0 DMA underrun interrupt 
      \arg        DAC_INT_DDUDR1: DACx_OUT1 DMA underrun interrupt 
    \param[out] none
    \retval     none
*/
void dac_interrupt_enable(uint32_t dac_periph, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    } else if(NOT_DAC_INTERRUPT(interrupt)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001AU), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(interrupt & DAC_INT_EN_MASK0){
            /* enable underrun interrupt */
            DAC_CTL0(dac_periph) |= (uint32_t)(interrupt & DAC_INT_EN_MASK0);
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      disable DAC interrupt
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  interrupt: the DAC interrupt
                only one parameter can be selected which is shown as below:
      \arg        DAC_INT_DDUDR0: DACx_OUT0 DMA underrun interrupt
      \arg        DAC_INT_DDUDR1: DACx_OUT1 DMA underrun interrupt
    \param[out] none
    \retval     none
*/
void dac_interrupt_disable(uint32_t dac_periph, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001BU), ERR_PERIPH);
    } else if(NOT_DAC_INTERRUPT(interrupt)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001BU), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(interrupt & DAC_INT_EN_MASK0){
            /* disable underrun interrupt */
            DAC_CTL0(dac_periph) &= (uint32_t)(~(interrupt & DAC_INT_EN_MASK0));
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      get DAC interrupt flag
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  int_flag: DAC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        DAC_INT_FLAG_DDUDR0: DACx_OUT0 DMA underrun interrupt flag
      \arg        DAC_INT_FLAG_DDUDR1: DACx_OUT1 DMA underrun interrupt flag
    \param[out] none
    \retval     the state of DAC interrupt flag(SET or RESET)
*/
FlagStatus dac_interrupt_flag_get(uint32_t dac_periph, uint32_t int_flag)
{
    uint32_t reg1 = 0U, reg2 = 0U;
    FlagStatus flag_state;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    } else if(NOT_DAC_INT_FLAG(int_flag)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001CU), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(int_flag & DAC_INT_FLAG_MASK0){
            /* check underrun interrupt int_flag */
            reg1 = DAC_STAT0(dac_periph) & int_flag;
            reg2 = DAC_CTL0(dac_periph) & int_flag;
        }else{
            /* illegal parameters */
        }

        /*get DAC interrupt flag status */
        if((RESET != reg1) && (RESET != reg2)){
            flag_state = SET;
        }else{
            flag_state = RESET;
        }
    }
    return flag_state;
}

/*!
    \brief      clear DAC interrupt flag
    \param[in]  dac_periph: DACx(x=0)
    \param[in]  int_flag: DAC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        DAC_INT_FLAG_DDUDR0: DACx_OUT0 DMA underrun interrupt flag
      \arg        DAC_INT_FLAG_DDUDR1: DACx_OUT1 DMA underrun interrupt flag
    \param[out] none
    \retval     none
*/
void dac_interrupt_flag_clear(uint32_t dac_periph, uint32_t int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_DAC_PERIPH(dac_periph)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    } else if(NOT_DAC_INT_FLAG(int_flag)) {
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001DU), ERR_PARAM_INVALID);
    }  else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear underrun interrupt int_flag */
        if(int_flag & DAC_INT_FLAG_MASK0)
        {
            DAC_STAT0(dac_periph) = (uint32_t)int_flag;
        }
    }
}
